//1. получить значение из input username
// получить значение из input password
// вывести значения в out-username и out-password

//2. получить значение из input  когда нажимается кнопка Add task вывести значение в консоль
//  добавить значние inputa в массив todoList как объект в объекте должно быть два свойства task и id (id должен быть рандомный  Math.random())

// 3  добавить значение в список ul как li (через createElement)

//4 Переписать задачу 3. Теперь вместе с текстом добавить кнопку удалить (через createElement)

//4. Добавить событие на кнопку удалить. При нажатии на кнопку удалить, удалять li из ul и из массива todoList

//5. Добавить кнопку очистить список. При нажатии на кнопку очистить список, удалять все li из ul
